Revit 2024 API
BuiltInFailures.CurtainGridFamilyFailures.CannotCreateCornerMullionDueAngle Property
 Can't create Corner Mullion due to the angle between the neighboring panels. Try changing the Parameters in the Curtain Wall Mullion Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateCornerMullionDueAngle { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateCornerMullionDueAngle As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateCornerMullionDueAngle {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace